insert into school_class(id, name) values
(1, '11'),
(2, '10'),
(3, '9А'),
(4, '9Б'),
(5, '8А'),
(6, '8Б'),
(7, '7А'),
(8, '7Б'),
(9, '6А'),
(10, '6Б');

insert into class_vaccination(id, name) values
(1, 'Профилактическая прививка (делается один раз)'),
(2, 'Профилактических прививок по эпидемическим показаниям');

insert into vaccinations(id, name, interval, vaccination_class_id) values
(1, 'Первая вакцинация против вирусного гепатита В', 'P1D', 1),
(2, 'Вакцинация против туберкулеза', 'P7D', 1),
(3, 'Вторая вакцинация против вирусного гепатита В', 'P1M', 1),
(4, 'Третья вакцинация против вирусного гепатита В (группы риска)', 'P2M', 1),
(5, 'Первая вакцинация против пневмококковой инфекции', 'P2M', 1),
(6, 'Первая вакцинация против дифтерии, коклюша, столбняка', 'P3M', 1),
(7, 'Первая вакцинация против полиомиелита', 'P3M', 1),
(8, 'Первая вакцинация против гемофильной инфекции типа b', 'P3M', 1),
(9, 'Вторая вакцинация против дифтерии, коклюша, столбняка', 'P4M', 1),
(10, 'Вторая вакцинация против гемофильной инфекции типа b', 'P4M', 1),
(11, 'Вторая вакцинация против полиомиелита', 'P4M', 1),
(12, 'Вторая вакцинация против пневмококковой инфекции', 'P4M', 1),
(13, 'Третья вакцинация против дифтерии, коклюша, столбняка', 'P6M', 1),
(14, 'Третья вакцинация против вирусного гепатита B', 'P6M', 1),
(15, 'Третья вакцинация против полиомиелита', 'P6M', 1),
(16, 'Третья вакцинация против гемофильной инфекции типа b', 'P6M', 1),
(17, 'Вакцинация против кори, краснухи, эпидемического паротита', 'P12M', 1),
(18, 'Четвертая вакцинация против вирусного гепатита B (группы риска)', 'P12M', 1),
(19, 'Ревакцинация против пневмококковой инфекции', 'P15M', 1),
(20, 'Первая ревакцинация против дифтерии, коклюша, столбняка', 'P18M', 1),
(21, 'Первая ревакцинация против полиомиелита', 'P18M', 1),
(22, 'Ревакцинация против гемофильной инфекции типа b', 'P18M', 1),
(23, 'Вторая ревакцинация против полиомиелита', 'P20M', 1),
(24, 'Ревакцинация против кори, краснухи, эпидемического паротита', 'P6Y', 1),
(25, 'Третья ревакцинация против полиомиелита', 'P6Y', 1),
(26, 'Вторая ревакцинация против дифтерии, столбняка', 'P7Y', 1),
(27, 'Ревакцинация против туберкулеза', 'P7Y', 1),
(28, 'Третья ревакцинация против дифтерии, столбняка', 'P14Y', 1),
(29, 'Вакцинация против вирусного гепатита B', 'P17Y', 1),
(30, 'Вакцинация против краснухи, ревакцинация против краснухи', 'P17Y', 1),
(31, 'Вакцинация против кори, ревакцинация против кори', 'P17Y', 1),
(32, 'Против туляремии', NULL, 2),
(33, 'Против чумы', NULL, 2),
(34, 'Против бруцеллеза', NULL, 2),
(35, 'Против сибирской язвы', NULL, 2),
(36, 'Против бешенства', NULL, 2),
(37, 'Против лептоспироза', NULL, 2),
(38, 'Против клещевого вирусного энцефалита', NULL, 2),
(39, 'Против лихорадки Ку', NULL, 2),
(40, 'Против желтой лихорадки', NULL, 2),
(41, 'Против холеры', NULL, 2),
(42, 'Против брюшного тифа', NULL, 2),
(43, 'Против вирусного гепатита А', NULL, 2),
(44, 'Против шигеллезов', NULL, 2),
(45, 'Против менингококковой инфекции', NULL, 2),
(46, 'Против кори', NULL, 2),
(47, 'Против вирусного гепатита В', NULL, 2),
(48, 'Против дифтерии', NULL, 2),
(49, 'Против эпидемического паротита', NULL, 2),
(50, 'Против полиомиелита', NULL, 2),
(51, 'Против пневмококковой инфекции', NULL, 2),
(52, 'Против ротавирусной инфекции', NULL, 2),
(53, 'Против ветряной оспы', NULL, 2),
(54, 'Против гемофильной инфекции', NULL, 2),
(55, 'Против коронавирусной инфекции, вызываемой вирусом SARS-CoV-2', NULL, 2);

insert into med_institute(id, name, address) values
(1, 'Поликлиника № 1', 'ул. Дерендяева, 97, Киров, Кировская обл.'),
(2, 'Поликлиника № 2 Кировская Городская Больница №9', 'ул. Сурикова, 26А, Киров, Кировская обл.'),
(3, 'Поликлиника № 6 ККДЦ', 'Красноармейская ул., 30Б, Киров, Кировская обл.'),
(4, 'Поликлиника № 3 ККДЦ', 'ул. Молодой Гвардии, 98, Киров, Кировская обл.'),
(5, 'Поликлиника № 5 ККДЦ', 'Московская ул., 6, Киров, Кировская обл.'),
(6, 'Поликлиника № 7 ККДЦ', 'ул. Карла Маркса, 47, Киров, Кировская обл.'),
(7, 'Поликлиника № 2 Кировская Городская Больница №8', 'Производственная ул., 6, Киров, Кировская обл.'),
(8, 'КОГБУЗ "Центр Травматологии, Ортопедии И нейрохирургии"', 'ул. Менделеева, 17, Киров, Кировская обл.'),
(9, 'КОГБУЗ "Инфекционная клиническая больница"', 'Ленина ул., 207, Киров, Кировская обл.'),
(10, 'КОГБУЗ "Северная клиническая больница скорой медицинской помощи"', 'ул. Свердлова, 4, Киров, Кировская обл.'),
(11, 'Кировская Городская Больница № 5', 'ул. Семашко, 1, Киров, Кировская обл.'),
(12, 'Кировская областная клиническая психиатрическая больница им. академика В.М. Бехтерева', 'ул. Центральная, Киров, Кировская обл.'),
(13, 'Детская поликлиника №1', 'ул. Карла Маркса, 42, Киров, Кировская обл.'),
(14, 'Детская поликлиника №2', 'ул. Некрасова, 14, Киров, Кировская обл.'),
(15, 'Детская поликлиника №3', 'Пролетарская ул., 21, Киров, Кировская обл.'),
(16, 'Детская поликлиника №4. Филиал', 'ул. Монтажников, 32, Киров, Кировская обл.'),
(17, 'КОГБУЗ Детский клинический консультативно-диагностический центр Детская поликлиника № 2', 'ул. Некрасова, 40, Киров, Кировская обл.');

insert into users (username, password, enabled, firstname, lastname, patronymic, gender, birthday, phone, email, url, school_class_id) values
('alexBond', '1', true, 'Алексей', 'Бондаренко', 'Петрович', 'М', '2001-12-16', '+7(953)-136-75-52', 'alexrezon@mail.ru', '/icon.png', 1),
('antosha2002', '1', true, 'Антон', 'Шутов', 'Алексеевич', 'М', '2002-09-06', '+7(922)-663-90-98', 'antoshaShutov2002@mail.ru', '/icon.png', 1),
('admin', 'admin', true, 'Алиса', 'Донникова', '', 'Ж', '1970-05-01', '+6(666)-666-66-66', 'aliceDon@mail.ru', '/icon.png', null);


insert into authorities (id, authority, username) values
(1, 'ROLE_USER', 'alexBond'),
(2, 'ROLE_ADMIN', 'admin'),
(3, 'ROLE_USER', 'antosha2002');

insert into vaccination_certifficates (id, date_give, group_blood, rhesus, med_institute_id, username) values
(1, '2003-01-01', '2', false, 1, 'alexBond'),
(2, '2004-01-01', '2', false, 1, 'antosha2002');

insert into vaccination_and_certifficate (id, date_vaccination, reaction, vaccination_certifficate_id, vaccination_id) values 
(1, '2001-12-16', '...', 1, 1),
(2, '2001-12-16', '...', 1, 2),
(3, '2001-12-16', '...', 1, 3),
(4, '2001-12-16', '...', 1, 4);

